/* The name of the app */
"APP_NAME" = "Next Bus";

/*
 
 GENERIC
 
 */

/* OK button */
"OK" = "OK";

/* Done button */
"DONE" = "Done";

/* Create button */
"CREATE" = "Create";

/* Cancel button */
"CANCEL" = "Cancel";

/* Name (not personal name) text field placeholder */
"NAME" = "Name";

/* [Currently selected] Route */
"ROUTE" = "Route";

/* [Currently selected] Stop */
"STOP" = "Stop";

/* Choose/select button */
"CHOOSE" = "Choose";

/* Change button */
"CHANGE" = "Change";

/* Save button */
"SAVE" = "Save";

/* Starts [some time] */
"STARTS" = "Starts";

/* Ends [some time] */
"ENDS" = "Ends";

/* Repeats [Everyday OR Monday & Tuesday] */
"REPEATS" = "Repeats";

/* [Repeats] Every Day */
"EVERYDAY" = "Every Day";

/* [Repeats] Some Days */
"SOME_DAYS" = "Some Days";

/* Settings section */
"SETTINGS" = "Settings";

/* Time label */
"TIME" = "Time";

/* Delete button */
"DELETE" = "Delete";

/* Search field */
"SEARCH" = "Search";

/* An error occurred title */
"GENERIC_ERROR_TITLE" = "An error occurred";

/* Error description */
"GENERIC_ERROR_DESCRIPTION" = "We're not sure what happened.";

/* Error helper text */
"GENERIC_ERROR_SUGGESTION" = "Try again later or contact support.";

/*
 
 SHARED
 
 */

/* Add to Favorites button */
"ADD_TO_FAVORITES" = "Add to Favorites";

/* Add to Siri Button */
"ADD_TO_SIRI" = "Add to Siri";

/* Directions button */
"DIRECTIONS_BUTTON" = "Directions";

/* The origin of a route or directions */
"FROM %@" = "from %@";

/* From search field placeholder */
"FROM_PLACEHOLDER" = "From";

/* Inbound direction */
"INBOUND" = "Inbound";

/* Loading routes label */
"LOADING_ROUTES" = "Loading Routes...";

/* Loading stops label */
"LOADING_STOPS" = "Loading Stops...";

/* Loading route label */
"LOADING_ROUTE" = "Loading Route...";

/* Loading stop label */
"LOADING_STOP" = "Loading Stop...";

/* One way direction */
"ONE_WAY" = "One Way";

/* Outbound direction */
"OUTBOUND" = "Outbound";

/* Remove Favorite button */
"REMOVE_FAVORITE" = "Remove Favorite";

/* Remove from recents button */
"REMOVE_RECENT" = "Remove from Recents";

/* Route name label */
"ROUTE_NAME %@" = "Route %@";

/* Select route title */
"SELECT_ROUTE" = "Select Route";

/* Select stop title */
"SELECT_STOP" = "Select Stop";

/* Share button */
"SHARE" = "Share";

/* The destination of a route or directions */
"TO %@" = "to %@";

/* To search field placeholder */
"TO_PLACEHOLDER" = "To";

/*
 
 DASHBOARD SECTION
 
 */

/* Dashboard section name */
"DASHBOARD.NAME" = "Dashboard";

/* Favorites section name */
"DASHBOARD.FAVORITES" = "Favorites";

/* Recents section name */
"DASHBOARD.RECENTS" = "Recents";

/* Current schedule label */
"DASHBOARD.CURRENT_SCHEDULE %@" = "Currently: %@";

/* No favorites placeholder label */
"DASHBOARD.NO_FAVORITES" = "No Favorites";

/* No recently viewed routes placeholder label */
"DASHBOARD.NO_RECENTS" = "No Recents";

/* All favorites section title */
"DASHBOARD.ALL_FAVORITES" = "All Favorites";

/*
 
 DIRECTIONS SECTION
 
 */

/* Directions section name */
"DIRECTIONS.NAME" = "Directions";

/* Change routing button */
"DIRECTIONS.CHANGE_ROUTING" = "Change Routing";

/* Enable button */
"DIRECTIONS.ENABLE" = "Enable";

/* Go button */
"DIRECTIONS.GO" = "Go";

/* Open walking directions (in Maps) button */
"DIRECTIONS.OPEN_WALKING_DIRECTIONS" = "Open Walking Directions";

/* Select routing button */
"DIRECTIONS.SELECT_ROUTING" = "Select Routing";

/* Finding directions in progress */
"DIRECTIONS.FINDING_DIRECTIONS" = "Finding Directions...";

/* Searching in progress */
"DIRECTIONS.SEARCHING" = "Searching...";

/* Current location label */
"DIRECTIONS.CURRENT_LOCATION" = "Current Location";

/* Travel time label */
"DIRECTIONS.%@ MINS" = "%@ mins";

/* Train directions description */
"DIRECTIONS.RIDE_ON_TRAIN %@" = "Ride on the %@";

/* Location search field placeholder */
"DIRECTIONS.SEARCH_FOR_LOCATION" = "Search for a place or address";

/* Bus directions description */
"DIRECTIONS.TAKE_THE_BUS %@" = "Take the %@";

/* Ferry directions description */
"DIRECTIONS.TAKE_THE_FERRY" = "Take the Ferry";

/* Tram directions description */
"DIRECTIONS.TAKE_THE_TRAM" = "Take the Tram";

/* Walking directions description */
"DIRECTIONS.WALK_TO %@" = "Walk to %@";

/* Directions route picker title */
"DIRECTIONS.WHICH_ROUTE" = "Which route?";

/* Location required sheet title */
"DIRECTIONS.LOCATION_REQUIRED_TITLE" = "Enable Location for Directions";

/* Location required sheet description */
"DIRECTIONS.LOCATION_REQUIRED_DESCRIPTION" = "Get public transport directions around Hong Kong—wherever you are.";

/* Location required sheet error */
"DIRECTIONS.LOCATION_REQUIRED_ERROR" = "Location access has been disabled. Enable it in the Settings app.";

/*
 
 SCHEDULE SECTION
 
 */

/* Schedule section name */
"SCHEDULE.NAME" = "Schedule";

/* Schedule section description and helper text */
"SCHEDULE.DESCRIPTION" = "Create Schedules to quickly see your daily routes on Dashboard and receive notifications with bus arrival times.";

/* Add schedule button */
"SCHEDULE.ADD" = "Add Schedule";

/* New schedule title/button */
"SCHEDULE.NEW" = "New Schedule";

/* Edit schedule title/button */
"SCHEDULE.EDIT" = "Edit Schedule";

/* Arrival time notifications option label */
"SCHEDULE.ARRIVAL_TIME_NOTIFICATIONS" = "Arrival Time Notifications";

/* Delete schedule button */
"SCHEDULE.DELETE" = "Delete Schedule";

/* Enable notifications title */
"SCHEDULE.ENABLE_NOTIFICATIONS_TITLE" = "Enable Notifications";

/* Enable notifications description */
"SCHEDULE.ENABLE_NOTIFICATIONS_DESCRIPTION" = "Receive notifications with the latest bus arrival time when schedules start.";

/* Notifications disabled title */
"SCHEDULE.NOTIFICATIONS_DISABLED_TITLE" = "Notifications Disabled";

/* Notifications disabled description */
"SCHEDULE.NOTIFICATIONS_DISABLED_DESCRIPTION" = "You will not receive notifications when schedules start.";

/*
 
 ROUTES SECTION
 
 */

/* Routes section name */
"ROUTES.NAME" = "Routes";

/*
 
 BUS DETAIL SECTION
 
 */

/* Show nearby stops button */
"BUS_DETAIL.SHOW_NEARBY_BUS_STOPS" = "Show Nearby Bus Stops";

/*
 
 STOP DETAIL SECTION
 
 */

/* At 11:11am */
"STOP_DETAIL.AT" = "At ";

/* All bus stops section label */
"STOP_DETAIL.ALL_BUS_STOPS" = "All Bus Stops";

/* Arriving soon header */
"STOP_DETAIL.ARRIVING_SOON" = "Arriving Soon";

/* Arrival information not available label */
"STOP_DETAIL.ARRIVAL_INFORMATION_NOT_AVAILABLE" = "Arrival information is not yet available for this route.";

/* Arrival information not available right now label */
"STOP_DETAIL.ARRIVAL_INFORMATION_NOT_CURRENTLY_AVAILABLE" = "Arrival information is not currently available. This route may be diverted, suspended, or not currently in service.";

/* Nearby bus stops section label */
"STOP_DETAIL.NEARBY_BUS_STOPS" = "Nearby Bus Stops";

/* Info section label */
"STOP_DETAIL.INFO" = "Info";

/* Map section label */
"STOP_DETAIL.MAP" = "Map";

/* Last updated at 11:11am */
"STOP_DETAIL.LAST_UPDATED" = "Last updated %@";

/*
 
 UPGRADE SECTION
 
 */

/* Upgrade title prefix */
"UPGRADE.TITLE_PREFIX" = "Upgrade to";

/* Upgrade purchase name */
"UPGRADE.PRODUCT_NAME" = "Next Bus+";

/* Upgrade list title */
"UPGRADE.WIDGETS.TITLE" = "Widgets";

/* Upgrade list description */
"UPGRADE.WIDGETS.DESCRIPTION" = "Add widgets to your home screen to instantly see arrival times";

/* Upgrade list title */
"UPGRADE.SCHEDULE.TITLE" = "Schedule";

/* Upgrade list description */
"UPGRADE.SCHEDULE.DESCRIPTION" = "Create schedules to see your daily routes on Dashboard";

/* Upgrade list title */
"UPGRADE.NOTIFICATIONS.TITLE" = "Notifications";

/* Upgrade list description */
"UPGRADE.NOTIFICATIONS.DESCRIPTION" = "Receive notifications when it's time for your daily routes";

/* Upgrade list title */
"UPGRADE.SUPPORT.TITLE" = "Support Next Bus";

/* Upgrade list description */
"UPGRADE.SUPPORT.DESCRIPTION" = "Support future updates to the app by the independent developer";

/* Upgrade restore purchases button */
"UPGRADE.RESTORE_PURCHASES" = "Restore Purchases";

/* Upgrade required title */
"UPGRADE.REQUIRED_TITLE" = "Next Bus+ Required";

/* Upgrade required description */
"UPGRADE.REQUIRED_DESCRIPTION" = "Upgrade now to get access!";

/* Upgrade suggested title */
"UPGRADE.SUGGESTED_TITLE" = "Upgrade to Next Bus+";

/* Upgrade suggested description */
"UPGRADE.SUGGESTED_DESCRIPTION" = "Create widgets, receive arrival notifications, and more!";

/*
 
 CATEGORIES
 
 */

/* Bus category name */
"CATEGORY.BUS" = "Bus";

/* Minibus category name */
"CATEGORY.MINIBUS" = "Minibus";

/* Train category name */
"CATEGORY.TRAIN" = "Train";

/* Tram category name */
"CATEGORY.TRAM" = "Tram";

/* Ferry category name */
"CATEGORY.FERRY" = "Ferry";

/*
 
 COMPANY NAMES
 
 */

/* Citybus company name */
"COMPANY.CTB" = "Citybus";

/* Discovery Bay Bus company name */
"COMPANY.DB" = "Discovery Bay Bus";

/* Ferry name */
"COMPANY.FERRY" = "Ferry";

/* Green Minibus company name */
"COMPANY.GMB" = "Green Minibus";

/* KMB company name */
"COMPANY.KMB" = "KMB";

/* KMB & Citybus company name */
"COMPANY.KMB_CTB" = "KMB & Citybus";

/* KMB & NWFB company name */
"COMPANY.KMB_NWFB" = "KMB & NWFB";

/* MTR Feeder company name */
"COMPANY.LRT_FEEDER" = "MTR Feeder";

/* Long Win Bus company name */
"COMPANY.LWB" = "Long Win Bus";

/* Long Win Bus & Citybus company name */
"COMPANY.LWB_CTB" = "Long Win Bus & Citybus";

/* Ma Wan Bus company name */
"COMPANY.PI" = "Ma Wan Bus";

/* MTR name */
"COMPANY.MTR" = "MTR";

/* New Lantao Bus company name */
"COMPANY.NLB" = "New Lantao Bus";

/* NWFB company name */
"COMPANY.NWFB" = "NWFB";

/* Tram name */
"COMPANY.TRAM" = "Tram";

/* LMC Coach company name */
"COMPANY.XB" = "LMC Coach";

/* Unknown */
"COMPANY.UNKNOWN" = "Unknown";

/*
 
 APP CLIP
 
 */

/* Failed to load route error text */
"CLIP.FAILED_TO_LOAD_ROUTE" = "Failed to load route.";

/* Continue to all routes button */
"CLIP.CONTINUE_TO_ROUTES" = "Continue to All Routes";

/*
 
 NOTIFICATIONS
 
 */

/* Notification title */
"NOTIFICATIONS.TITLE %@" = "It's time for %@.";

/* Notification description and helper */
"NOTIFICATIONS.DESCRIPTION %@" = "Press and hold to check when the %@ will arrive.";

/*
 
 SIRI
 
 */

/* Suggested Siri phrase for Get Upcoming Buses (no route, no stop) */
"SIRI.GET_UPCOMING_BUSES.PHRASE" = "When's the next bus?";

/* Suggested Siri phrase for Get Upcoming Buses (with route, no stop) */
"SIRI.GET_UPCOMING_BUSES.PHRASE.WITH_ROUTE %@" = "When's the next %@?";

/* Suggested Siri phrase for Get Upcoming Buses (with route and stop) */
"SIRI.GET_UPCOMING_BUSES.PHRASE.WITH_ROUTE %@ STOP %@" = "When's the next %@ from %@?";

/*
 
 WIDGETS
 
 */

/* Arrival time widget name */
"WIDGETS.ARRIVAL_TIME.NAME" = "Live Arrival Time";

/* Arrival time widget error */
"WIDGETS.ARRIVAL_TIME.NOT_AVAILABLE" = "No arrival time";

/* Widget select routes error */
"WIDGETS.ARRIVAL_TIME.NO_ROUTES_SELECTED" = "No Routes Selected";

/* Widget select routes error description */
"WIDGETS.ARRIVAL_TIME.NO_ROUTES_SELECTED_DESCRIPTION" = "Select a route to see bus arrival times.";

/* Widget internet error */
"WIDGETS.ARRIVAL_TIME.FAILED_TO_LOAD" = "Failed to Load";

/* Widget upgrade required error */
"WIDGETS.ARRIVAL_TIME.UPGRADE_REQUIRED" = "Widgets require Next Bus+";

/* Widget select routes error */
"WIDGETS.ARRIVAL_TIME.UPGRADE_REQUIRED_DESCRIPTION" = "Upgrade in the app to get live widgets!";
